package JavaCore.Module2;

public class task11 {

    public static void main(String[] args) {

//        Задание 11 (дополнительное)
//        Написать программу подобную восьмой задаче.
//        Только пользователь вместо трех цветов вводит только один цвет - цвет основания пирамиды. Каждый последующий уровень пирамиды должен становиться немного светлее чем ниже стоящий.
//        В итоге должна получится градиентная пирамида такого типа, только из символов.

//        КАК????????????????????????????

    }
}
